Revit 2027 API
AirSystemData.AirFanType Property
 The fan type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AirFanType AirFanType { get; set; }
Public Property AirFanType As AirFanType
	Get
	Set
public:
property AirFanType AirFanType {
	AirFanType get ();
	void set (AirFanType value);
}
member AirFanType : AirFanType with get, set
Property Value
AirFanType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace